In [727]:
from math import sqrt
from typing import Any

import pandas as pd

# Data Processing

In [728]:
data_set: Any = pd.read_csv('source/train_source.csv', encoding='utf-8')
data_set.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3070 entries, 0 to 3069
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Company         3070 non-null   object
 1   City            3050 non-null   object
 2   Country         3068 non-null   object
 3   Industry        3070 non-null   object
 4   Investor        2940 non-null   object
 5   Last Valuation  3070 non-null   int64
 6   Unicorn         3070 non-null   int64
dtypes: int64(2), object(5)
memory usage: 168.0+ KB

In [729]:
data_set.head()

,Company,City,Country,Industry,Investor,Last Valuation,Unicorn
0,Slingshot Aerospace,Austin,United States,Aerospace,Techstars,200000000,0
1,Deepgram,San Francisco,United States,Artificial Intelligence,NVIDIA,250000000,0
2,Sense,Cambridge,United States,Consumer Electronics,Schneider Electric,550000000,0
3,Zume,Camarillo,United States,Consumer,FJ Labs,2250000000,1
4,Plant Prefab,Rialto,United States,Architecture,ICT Capital,100000000,0

## Company Name

In [730]:
company: list = data_set['Company'].tolist()

In [731]:
def count_special_char(name: str) -> int:
	special_char: list = ['!', '"', '#', '$', '%', '&', "'", '(', ')', '*', '+', ',', '-', '.', '/', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', ':', ';',
						  '<', '=', '>', '?', '@']
	special_char_count: int = 0
	for c in name:
		if c in special_char:
			special_char_count += 1

	return special_char_count

In [732]:
company_length: list = [len(c) for c in company]
company_words: list = [len(c.split(' ')) for c in company]
company_special: list = [count_special_char(c) for c in company]

In [733]:
data_set['Company Name Length'] = company_length
data_set['Company Name #Words'] = company_words
data_set['Company Name #Special Char'] = company_special
data_set.drop('Company', axis=1, inplace=True)

In [734]:
data_set

,City,Country,Industry,Investor,Last Valuation,Unicorn,Company Name Length,Company Name #Words,Company Name #Special Char
0,Austin,United States,Aerospace,Techstars,200000000,0,19,2,0
1,San Francisco,United States,Artificial Intelligence,NVIDIA,250000000,0,8,1,0
2,Cambridge,United States,Consumer Electronics,Schneider Electric,550000000,0,5,1,0
3,Camarillo,United States,Consumer,FJ Labs,2250000000,1,4,1,0
4,Rialto,United States,Architecture,ICT Capital,100000000,0,12,2,0
...,...,...,...,...,...,...,...,...,...
3065,Jacksonville,United States,E-commerce & direct-to-consumer,SoftBank Group,27000000000,1,8,1,0
3066,Hawthorne,United States,Other,Founders Fund,127000000000,1,6,1,0
3067,Brooklyn,United States,Internet software & services,Technology Crossover Ventures,5700000000,1,10,2,0
3068,Stockholm,Sweden,Fintech,Institutional Venture Partners,6700000000,1,6,1,0
3069,La Plaine Saint-Denis,France,E-commerce & direct-to-consumer,Summit Partners,1380000000,1,6,1,0

## City

In [735]:
data_set['City'] = data_set['City'].str.lower()
data_set['City'].value_counts()

san francisco            480
new york                 365
boston                    97
palo alto                 72
los angeles               66
                        ...
north charleston           1
wayland                    1
lake oswego                1
honolulu                   1
la plaine saint-denis      1
Name: City, Length: 502, dtype: int64

In [736]:
def city_mapping(city_name: str) -> int:
	city: dict = {'san francisco': 0, 'new york': 1}
	if city_name in city.keys():
		return city[city_name]
	return len(city)


data_set['City'] = data_set['City'].map(city_mapping)

In [737]:
data_set['City'].fillna(0, inplace=True)

In [738]:
data_set

,City,Country,Industry,Investor,Last Valuation,Unicorn,Company Name Length,Company Name #Words,Company Name #Special Char
0,2,United States,Aerospace,Techstars,200000000,0,19,2,0
1,0,United States,Artificial Intelligence,NVIDIA,250000000,0,8,1,0
2,2,United States,Consumer Electronics,Schneider Electric,550000000,0,5,1,0
3,2,United States,Consumer,FJ Labs,2250000000,1,4,1,0
4,2,United States,Architecture,ICT Capital,100000000,0,12,2,0
...,...,...,...,...,...,...,...,...,...
3065,2,United States,E-commerce & direct-to-consumer,SoftBank Group,27000000000,1,8,1,0
3066,2,United States,Other,Founders Fund,127000000000,1,6,1,0
3067,2,United States,Internet software & services,Technology Crossover Ventures,5700000000,1,10,2,0
3068,2,Sweden,Fintech,Institutional Venture Partners,6700000000,1,6,1,0
3069,2,France,E-commerce & direct-to-consumer,Summit Partners,1380000000,1,6,1,0

## Country

In [739]:
data_set['Country'] = data_set['Country'].str.lower()
data_set['Country'].value_counts()

united states           2506
china                    173
india                     70
united kingdom            50
germany                   30
israel                    24
france                    24
canada                    19
south korea               17
brazil                    16
singapore                 14
sweden                     8
mexico                     8
australia                  8
indonesia                  7
hong kong                  7
netherlands                7
japan                      6
switzerland                6
ireland                    6
spain                      5
finland                    5
norway                     5
united arab emirates       4
belgium                    3
turkey                     3
thailand                   3
colombia                   3
philippines                2
chile                      2
italy                      2
south africa               2
lithuania                  2
croatia                    2
austria                    2
vietnam                    2
denmark                    2
luxembourg                 1
bahamas                    1
argentina                  1
nigeria                    1
czech republic             1
malaysia                   1
liechtenstein              1
seychelles                 1
portugal                   1
pakistan                   1
ecuador                    1
estonia                    1
bermuda                    1
Name: Country, dtype: int64

In [740]:
def country_mapping(country_name: str) -> int:
	country: dict = {'united states': 0, 'china': 1}
	if country_name in country.keys():
		return country[country_name]
	return len(country)


data_set['Country'] = data_set['Country'].map(country_mapping)

In [741]:
data_set['Country'].fillna(0, inplace=True)

In [742]:
data_set

,City,Country,Industry,Investor,Last Valuation,Unicorn,Company Name Length,Company Name #Words,Company Name #Special Char
0,2,0,Aerospace,Techstars,200000000,0,19,2,0
1,0,0,Artificial Intelligence,NVIDIA,250000000,0,8,1,0
2,2,0,Consumer Electronics,Schneider Electric,550000000,0,5,1,0
3,2,0,Consumer,FJ Labs,2250000000,1,4,1,0
4,2,0,Architecture,ICT Capital,100000000,0,12,2,0
...,...,...,...,...,...,...,...,...,...
3065,2,0,E-commerce & direct-to-consumer,SoftBank Group,27000000000,1,8,1,0
3066,2,0,Other,Founders Fund,127000000000,1,6,1,0
3067,2,0,Internet software & services,Technology Crossover Ventures,5700000000,1,10,2,0
3068,2,2,Fintech,Institutional Venture Partners,6700000000,1,6,1,0
3069,2,2,E-commerce & direct-to-consumer,Summit Partners,1380000000,1,6,1,0

## Industry

In [743]:
data_set['Industry'] = data_set['Industry'].str.lower()
data_set['Industry'].value_counts()

artificial intelligence         239
fintech                         235
internet software & services    197
analytics                       151
biotechnology                   131
                               ...
robotics                          1
product design                    1
film production                   1
dating                            1
consumer & retail                 1
Name: Industry, Length: 272, dtype: int64

In [744]:
def industry_mapping(industry_name: str) -> int:
	industry: dict = {'artificial intelligence': 0, 'fintech': 1, 'internet software & services': 2, 'analytics': 3, 'biotechnology': 4, 'health care': 5,
					  'e-commerce & direct-to-consumer': 6}
	if industry_name in industry.keys():
		return industry[industry_name]
	return len(industry)


data_set['Industry'] = data_set['Industry'].map(industry_mapping)

In [745]:
data_set

,City,Country,Industry,Investor,Last Valuation,Unicorn,Company Name Length,Company Name #Words,Company Name #Special Char
0,2,0,7,Techstars,200000000,0,19,2,0
1,0,0,0,NVIDIA,250000000,0,8,1,0
2,2,0,7,Schneider Electric,550000000,0,5,1,0
3,2,0,7,FJ Labs,2250000000,1,4,1,0
4,2,0,7,ICT Capital,100000000,0,12,2,0
...,...,...,...,...,...,...,...,...,...
3065,2,0,6,SoftBank Group,27000000000,1,8,1,0
3066,2,0,7,Founders Fund,127000000000,1,6,1,0
3067,2,0,2,Technology Crossover Ventures,5700000000,1,10,2,0
3068,2,2,1,Institutional Venture Partners,6700000000,1,6,1,0
3069,2,2,6,Summit Partners,1380000000,1,6,1,0

## Investor

In [746]:
data_set['Investor'] = data_set['Investor'].str.lower()
data_set['Investor'].value_counts()

andreessen horowitz       88
techstars                 77
alumni ventures           66
y combinator              63
sequoia capital           60
                          ..
davis capital partners     1
james parker               1
sacramento angels          1
jmcr partners              1
l capital partners         1
Name: Investor, Length: 1255, dtype: int64

In [747]:
def investor_mapping(investor_name: str) -> int:
	investor: dict = {'andreessen horowitz': 0, 'techstars': 1, 'alumni ventures': 2, 'y combinator': 3, 'sequoia capital': 4, '500 global': 5,
					  'insight partners': 6}
	if investor_name in investor.keys():
		return investor[investor_name]
	return len(investor)


data_set['Investor'] = data_set['Investor'].map(investor_mapping)

In [748]:
data_set['Investor'].fillna(0, inplace=True)

In [749]:
data_set

,City,Country,Industry,Investor,Last Valuation,Unicorn,Company Name Length,Company Name #Words,Company Name #Special Char
0,2,0,7,1,200000000,0,19,2,0
1,0,0,0,7,250000000,0,8,1,0
2,2,0,7,7,550000000,0,5,1,0
3,2,0,7,7,2250000000,1,4,1,0
4,2,0,7,7,100000000,0,12,2,0
...,...,...,...,...,...,...,...,...,...
3065,2,0,6,7,27000000000,1,8,1,0
3066,2,0,7,7,127000000000,1,6,1,0
3067,2,0,2,7,5700000000,1,10,2,0
3068,2,2,1,7,6700000000,1,6,1,0
3069,2,2,6,7,1380000000,1,6,1,0

## Last Valuation

In [750]:
data_set['Last Valuation'].value_counts()

1000000000    281
15000000      152
10000000      146
150000000     141
200000000     135
             ...
505000000       1
475000000       1
460000000       1
445000000       1
6700000000      1
Name: Last Valuation, Length: 388, dtype: int64

In [751]:
def valuation_mapping(valuation: int) -> int:
	half = sqrt(10)
	scientific: list = '{:e}'.format(valuation).split('e')
	tail: float = float(scientific[0])
	power: int = int(scientific[1])
	if tail >= half:
		power += 1

	return power

In [752]:
data_set['Last Valuation'] = data_set['Last Valuation'].map(valuation_mapping)

In [753]:
data_set

,City,Country,Industry,Investor,Last Valuation,Unicorn,Company Name Length,Company Name #Words,Company Name #Special Char
0,2,0,7,1,8,0,19,2,0
1,0,0,0,7,8,0,8,1,0
2,2,0,7,7,9,0,5,1,0
3,2,0,7,7,9,1,4,1,0
4,2,0,7,7,8,0,12,2,0
...,...,...,...,...,...,...,...,...,...
3065,2,0,6,7,10,1,8,1,0
3066,2,0,7,7,11,1,6,1,0
3067,2,0,2,7,10,1,10,2,0
3068,2,2,1,7,10,1,6,1,0
3069,2,2,6,7,9,1,6,1,0

# Training

In [754]:
data_set.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3070 entries, 0 to 3069
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   City                        3070 non-null   int64
 1   Country                     3070 non-null   int64
 2   Industry                    3070 non-null   int64
 3   Investor                    3070 non-null   int64
 4   Last Valuation              3070 non-null   int64
 5   Unicorn                     3070 non-null   int64
 6   Company Name Length         3070 non-null   int64
 7   Company Name #Words         3070 non-null   int64
 8   Company Name #Special Char  3070 non-null   int64
dtypes: int64(9)
memory usage: 216.0 KB